function generate() {
  let verses = [
    "എൻ്റെ ചിത്തം എൻ്റെ രക്ഷകനായ ദൈവത്തില്‍ ആനന്ദിക്കുന്നു (ലൂക്കാ 1:47)",
    "ആ പ്രദേശത്തെ വയലുകളില്‍, ആടുകളെ രാത്രി കാത്തുകൊണ്ടിരുന്ന ഇടയന്‍മാര്‍ ഉണ്ടായിരുന്നു. കര്‍ത്താവിൻ്റെ ദൂതന്‍ അവരുടെ അടുത്തെത്തി (ലൂക്കാ 2:89)",

    "അത്യുന്നതങ്ങളില്‍ ദൈവത്തിന് മഹത്വം! ഭൂമിയില്‍ ദൈവകൃപ ലഭിച്ചവര്‍ക്ക് സമാധാനം! (ലൂക്കാ 2:14)",

    "പിള്ളക്കച്ചകൊണ്ട് പൊതിഞ്ഞ് പുല്‍ത്തൊട്ടിയില്‍ കിടത്തിയിരിക്കുന്ന ഒരു ശിശുവിനെ നിങ്ങള്‍ കാണും. (ലൂക്കാ 2:16)",

    "അവള്‍ തൻ്റെ കടിഞ്ഞൂല്‍പുത്രനെ പ്രസവിച്ചു. അവനെ പിള്ളക്കച്ചകൊണ്ട് പൊതിഞ്ഞ് പുല്‍ത്തൊട്ടിയില്‍ കിടത്തി (ലൂക്കാ 2:7)",

    "യേശുക്രിസ്തുവിനുണ്ടായിരുന്ന ഈ മനോഭാവം നിങ്ങളിലും ഉണ്ടാകട്ടെ. ദൈവത്തിൻ്റെ രൂപത്തിലായിരുന്നുവെങ്കിലും അവന്‍ ദൈവവുമായുള്ള സമാനത നിലനിര്‍ത്തേണ്ട കാര്യമായി പരിഗണിച്ചില്ല. തന്നെത്തന്നെ ശൂന്യനാക്കിക്കൊണ്ട് ദാസൻ്റെ രൂപം സ്വീകരിച്ച് ആകൃതിയില്‍ മനുഷ്യനെപ്പോലെ കാണപ്പെട്ടു (ഫിലിപ്പി 2:57)",

    "ഇതായിരിക്കും നിങ്ങള്‍ക്ക് അടയാളം: പിള്ളക്കച്ചകൊണ്ടു പൊതിഞ്ഞ്, പുല്‍ത്തൊട്ടിയില്‍ കിടത്തിയിരിക്കുന്ന ഒരു ശിശുവിനെ നിങ്ങള്‍ കാണും.  (ലൂക്കാ 2:12)",

    "തൻ്റെ ഏകജാതനായ പുത്രനിൽ വിശ്വസിക്കുന്ന ഏവനും നശിച്ചുപോകാതെ നിത്യജീവൻ പ്രാപിക്കേണ്ടതിന്നു ദൈവം അവനെ നല്കുവാൻ തക്കവണ്ണം ലോകത്തെ അത്രമേൽ സ്നേഹിച്ചു. (യോഹന്നാൻ 3:16)",
    "കർത്താവായ ദൈവത്തിൻ്റെ അരൂപി എന്നിലുണ്ട്. കാരണം പീഡിതർക്ക് സദ്വാർത്ത എത്തിക്കാൻ കർത്താവ് എന്നെ അഭിഷേചിച്ചിരിക്കുന്നു ( ഏശയ്യാ 61:1)",
    "കര്‍ത്താവ് എൻ്റെ ഇടയനാകുന്നു, എനിക്കൊന്നിനും കുറവുണ്ടാകുകയില്ല.(സങ്കീർത്തനം 23:1)",
    "അവൻ്റെ വായ് വെണ്ണപോലെ മൃദുവായതു ,ഹൃദയത്തിലോ യുദ്ധമത്രേ.അവൻ്റെ വാക്കുകൾ എണ്ണയെക്കാൾ മയമുള്ളവ, എങ്കിലും അവ ഊരിയ വാൾ പോലെയായിരുന്നു. (സങ്കീർത്തനം 55:21)",
    "ദൈവത്തിന്‍റെ കല്‌പനകൾ അനുസരിക്കുന്നതാണു ദൈവത്തോടുള്ള സ്‌നേഹം. ദൈവത്തിന്‍റെ കല്‌പനകൾ ഒരു ഭാരമല്ല.  1 യോഹന്നാൻ 5:3",
  ];

  let verse = verses[Math.floor(Math.random() * verses.length)];

  document.getElementById("output").innerHTML = verse;
}
