function generate() {
  verse = [
    "ആദിയിൽ ദൈവം ആകാശവും ഭൂമിയും സൃഷ്ടിച്ചു",
    "ഭൂമി പാഴായും ശൂന്യമായും ഇരുന്നു; ആഴത്തിന്മീതെ ഇരുൾ ഉണ്ടായിരുന്നു. ദൈവത്തിന്റെ ആത്മാവു വെള്ളത്തിൻ മീതെ പരിവർത്തിച്ചുകൊണ്ടിരുന്നു.",
    "വെളിച്ചം നല്ലതു എന്നു ദൈവം കണ്ടു ദൈവം വെളിച്ചവും ഇരുളും തമ്മിൽ വേർപിരിച്ചു.",
    "ദൈവം വെളിച്ചത്തിന്നു പകൽ എന്നും ഇരുളിന്നു രാത്രി എന്നും പേരിട്ടു. സന്ധ്യയായി ഉഷസ്സുമായി, ഒന്നാം ദിവസം.",
    "ദൈവം വെള്ളങ്ങളുടെ മദ്ധ്യേ ഒരു വിതാനം ഉണ്ടാകട്ടെ; അതു വെള്ളത്തിന്നും വെള്ളത്തിന്നും തമ്മിൽ വേർപിരിവായിരിക്കട്ടെ എന്നു കല്പിച്ചു.",
    "വിതാനം ഉണ്ടാക്കീട്ടു ദൈവം വിതാനത്തിൻ കീഴുള്ള വെള്ളവും വിതാനത്തിൻ മീതെയുള്ള വെള്ളവും തമ്മിൽ വേർപിരിച്ചു; അങ്ങനെ സംഭവിച്ചു.",
    "ദൈവം വിതാനത്തിന്നു ആകാശം എന്നു പേരിട്ടു. സന്ധ്യയായി ഉഷസ്സുമായി, രണ്ടാം ദിവസം.",
    "ദൈവം: ആകാശത്തിൻ കീഴുള്ള വെള്ളം ഒരു സ്ഥലത്തു കൂടട്ടെ; ഉണങ്ങിയ നിലം കാണട്ടെ എന്നു കല്പിച്ചു; അങ്ങനെ സംഭവിച്ചു.",
    "ഉണങ്ങിയ നിലത്തിന്നു ദൈവം ഭൂമി എന്നും വെള്ളത്തിന്റെ കൂട്ടത്തിന്നു സമുദ്രം എന്നും പേരിട്ടു; നല്ലതു എന്നു ദൈവം കണ്ടു.",
    "ഭൂമിയിൽനിന്നു പുല്ലും വിത്തുള്ള സസ്യങ്ങളും ഭൂമിയിൽ അതതു തരം വിത്തുള്ള ഫലം കായിക്കുന്ന വൃക്ഷങ്ങളും മുളെച്ചുവരട്ടെ എന്നു ദൈവം കല്പിച്ചു; അങ്ങനെ സംഭവിച്ചു.",
    "പകലും രാവും തമ്മിൽ വേർപിരിവാൻ ആകാശവിതാനത്തിൽ വെളിച്ചങ്ങൾ ഉണ്ടാകട്ടെ; അവ അടയാളങ്ങളായും കാലം, ദിവസം, സംവത്സരം എന്നിവ തിരിച്ചറിവാനായും ഉതകട്ടെ;",
    "ഭൂമിയെ പ്രകാശിപ്പിപ്പാൻ ആകാശവിതാനത്തിൽ അവ വെളിച്ചങ്ങളായിരിക്കട്ടെ എന്നു ദൈവം കല്പിച്ചു; അങ്ങനെ സംഭവിച്ചു.",
    "പകൽ വാഴേണ്ടതിന്നു വലിപ്പമേറിയ വെളിച്ചവും രാത്രി വാഴേണ്ടതിന്നു വലിപ്പം കുറഞ്ഞ വെളിച്ചവും ആയി രണ്ടു വലിയ വെളിച്ചങ്ങളെ ദൈവം ഉണ്ടാക്കി; നക്ഷത്രങ്ങളെയും ഉണ്ടാക്കി.",
    "ദൈവം അവയെ ആകാശവിതാനത്തിൽ നിർത്തി; നല്ലതു എന്നു ദൈവം കണ്ടു.",
  ];
  document.getElementById("output").innerHTML =
    verse[Math.floor(Math.random() * verse.length)];
}
